
## Plan Result (prod)




<pre><code>Plan: 7 to add, 10 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_management_lock.storage-backup-ingest[0]
  * azurerm_role_assignment.powerapp_appreg_ingest
  * azurerm_role_assignment.powerapp_appreg_ingestfinal[0]
  * module.ingestsa_storage_account_backup[0].azapi_update_resource.defender_settings
  * module.ingestsa_storage_account_backup[0].time_rotating.rotate
  * module.ingestsa_storage_account_backup[0].time_static.pim_expiry
  * module.ingestsa_storage_account_backup[0].time_static.pim_start
* Update
  * azurerm_key_vault_secret.appinsights-key
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_key_vault_secret.voda_password[0]
  * azurerm_key_vault_secret.vodasa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights-key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey/3f0b5b0015844ecdab6c3712482dd017"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/app-insights-connection-string/6bcd095bf8684e48a86eb1d701fc4e9b"
        name                    = "app-insights-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "edit_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/videditvm1-password/76b1845bc8044195b61bde3d404bb83e"
        name                    = "videditvm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/sa-storage-account-connection-string/54fa132345714daea67251a1f1c32d97"
        name                    = "sa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.voda_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "voda_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodavm1-password/5f44ccd3a0114e11958b18a85abde922"
        name                    = "vodavm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-connection-string/432370f5d99d47068e93f0e9e0e0fda4"
        name                    = "vodasa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/4550b7d2873a4fc3963b0628b5366412"
        name                    = "vodasa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_management_lock.storage-backup-ingest[0] will be created
  + resource "azurerm_management_lock" "storage-backup-ingest" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "storage-backup"
      + notes      = "prevent users from deleting storage accounts"
      + scope      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupprod"
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.powerapp_appreg_ingest will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_ingest" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.powerapp_appreg_ingestfinal[0] will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_ingestfinal" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8cb76e1e-ef5a-41a7-9cb4-9513a48535dc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account_backup[0].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupprod"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.ingestsa_storage_account_backup[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.ingestsa_storage_account_backup[0].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.ingestsa_storage_account_backup[0].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 7 to add, 10 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1022,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->